Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionData
Component catalog dialog data item.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionData.item
Component item.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionData.collections
Collection data of compoenent item.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionData.#ctor(Tekla.Structures.Catalogs.ComponentItem)
Initializes a new instance of the ComponentCatalogCollectionData class.
newItem: The component catalog data constructor arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionData.AddToCollection(System.String)
Component catalog dialog data constructor.
newCollection: The component catalog collections to be added.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionData.Item
Gets component catalog component item.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionData.Collections
Gets component catalog collection information of component.